In [4]:
import pandas as pd

In [5]:
df_master = pd.read_csv("../data/customer_churn_records.csv")
df = df_master.copy()

In [6]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Complain,SatisfactionScore,CardType,PointEarned
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1,1,2,DIAMOND,464
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0,1,3,DIAMOND,456
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1,1,3,DIAMOND,377
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0,0,5,GOLD,350
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0,0,5,GOLD,425

In [7]:
df_sample = df.sample(100)
df_sample.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Complain,SatisfactionScore,CardType,PointEarned
2981,2982,15711218,Parry,616,Germany,Male,39,2,121704.32,2,1,0,55556.30,0,0,4,PLATINUM,346
7352,7353,15809800,Korovina,726,France,Female,38,4,0.00,2,0,0,6787.48,0,0,5,DIAMOND,523
8088,8089,15815656,Hopkins,541,Germany,Female,39,9,100116.67,1,1,1,199808.10,1,1,2,GOLD,635
5824,5825,15698953,Hart,636,Spain,Male,36,1,0.00,3,1,1,74048.10,1,1,5,DIAMOND,244
2816,2817,15619280,Uspensky,683,France,Male,25,4,0.00,2,1,0,152698.24,0,0,3,PLATINUM,637

In [8]:
for i in range(10):
    df_sample_1 = df.sample(100)
    df_sample_1.to_csv(f'../data/Folder A/customers_file_{i+1}.csv', index=False)

In [9]:
test_file = pd.read_csv("../data/Folder A/customers_file_1.csv")
test_file.head(10)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Complain,SatisfactionScore,CardType,PointEarned
0,9627,15665158,Chukwuemeka,813,Spain,Male,27,1,137275.36,1,0,1,115733.16,0,0,2,PLATINUM,799
1,1582,15576517,Everingham,445,Germany,Female,34,7,131082.17,2,1,1,70618.00,0,0,4,PLATINUM,802
2,1916,15769051,Shaw,503,Spain,Male,25,7,0.00,1,0,1,192841.13,0,0,1,SILVER,417
3,2526,15738411,Ho,505,France,Male,34,10,104498.79,1,0,1,126451.14,0,0,3,DIAMOND,244
4,6330,15661198,Howard,727,Germany,Male,34,2,146407.11,1,1,1,72073.72,0,0,2,GOLD,647
5,5620,15648951,Kao,785,Spain,Male,41,7,0.00,2,1,1,199108.88,0,0,5,SILVER,681
6,3843,15717185,Udinese,711,France,Male,28,8,0.00,2,1,1,64286.39,0,0,2,GOLD,997
7,8190,15613292,Ch'eng,715,France,Male,21,8,0.00,2,1,0,68666.63,0,0,2,PLATINUM,827
8,6041,15735358,Dowse,682,Spain,Male,46,4,0.00,1,1,1,4654.28,0,0,5,SILVER,221
9,1484,15790683,Matthews,850,France,Male,36,1,104077.19,2,0,1,68594.00,0,0,1,DIAMOND,388

In [4]:
test_dag_file = df.sample(10).to_csv("../data/Folder C/test_file.csv", index=False)

In [26]:
df_2 = df.copy()

In [27]:
df_2.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Complain,Satisfaction Score,Card Type,Point Earned
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1,1,2,DIAMOND,464
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0,1,3,DIAMOND,456
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1,1,3,DIAMOND,377
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0,0,5,GOLD,350
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0,0,5,GOLD,425

In [28]:
df_2.drop(["RowNumber", "CustomerId", "Geography", "Surname", "Complain", "Exited"], axis=1, inplace=True)

In [29]:
print(len(df_2))
df_2.head()

10000

,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Satisfaction Score,Card Type,Point Earned
0,619,Female,42,2,0.00,1,1,1,101348.88,2,DIAMOND,464
1,608,Female,41,1,83807.86,1,0,1,112542.58,3,DIAMOND,456
2,502,Female,42,8,159660.80,3,1,0,113931.57,3,DIAMOND,377
3,699,Female,39,1,0.00,2,0,0,93826.63,5,GOLD,350
4,850,Female,43,2,125510.82,1,1,1,79084.10,5,GOLD,425

In [30]:
test_api_for_dag = df_2.sample(10)
test_api_for_dag.to_csv("test_api_for_dag.csv", index=False)